# <center>Pandas Python Library for Beginners in Data Science
#### <center>Instructor: Vinita Silaparasetty

### Import Libraries

In [1]:
import numpy as np
import pandas as pd

# <center> Creating a Series

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/series.png?raw=true" width="600" height="600">

### <center> Method 1: Using an Array

In [2]:
s =([1,np.nan,' pandas librabry '])
s1 = pd.Series(s)
s1

0                    1
1                  NaN
2     pandas librabry
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s2, containing the following:

* Integer = 2

* Nan value

* Character = b

In [5]:
s_a = np.array([2, np.nan, 'b'])
s2 = pd.Series(s_a)
s2

0      2
1    nan
2      b
dtype: object

### <center> Method 2: Using a List

In [6]:
list1 =['animal', '2', 'animal']
s3 = pd.Series(list1)
s3

0    animal
1         2
2    animal
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s4.
Use a list, named list2, containing the following:

* Integer = 3

* Character = c

* String = Numpy 

Note:'N' Must be capital

In [7]:
list2 = [3, 'c', 'Numpy']
s4 = pd.Series(list2)
s4

0        3
1        c
2    Numpy
dtype: object

### <center> Method 3: Using a Dictionary

In [8]:
s5 = pd.Series( 
  {'A':1,
   '3': 'Python',
   })
s5 = pd.Series(s5)
s5

A         1
3    Python
dtype: object

## <center>üèÜ Challenge

Create a Pandas Series, named s6, containing the following:

* 'Integer' = 3
* 'B' = Boys

In [12]:
s6 = pd.Series({'Integer': 3, 'B': 'Boys'})
s6

Integer       3
B          Boys
dtype: object

# <center> Creating Data Frames

<img src="https://github.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/blob/master/Media/dataframe.gif?raw=true" width="600" height="600">

### <center> Method 1: Passing a Numpy Array

In [3]:
df = pd.DataFrame(np.random.randn(6, 4))
df

          0         1         2         3
0  1.021210 -1.469128 -0.700632  0.524741
1 -0.490700 -1.255631  2.145902 -0.613405
2 -0.994237 -1.334121  0.110211 -0.861490
3 -0.397260 -0.109347 -1.411179 -1.293969
4  1.022098  0.543734  1.068499  0.509776
5  0.844256 -0.819992  0.863949  1.849061

## <center>üèÜ Challenge

Create a data frame, named df1, which contains:

* A randomly generated array with the dimensions 3x3.

In [4]:
df1 = pd.DataFrame(np.random.randn(3,3))
df1

          0         1         2
0  0.385140  1.214653 -0.447495
1 -0.371132 -1.010486 -0.566486
2  0.264271  1.489773 -1.499875

### <center> Method 2: Passing a Dictionary of Objects

In [6]:
df2 = pd.DataFrame({
    'A':1,
    'number': np.array([6]*3, dtype='int32')
})
df2

   A  number
0  1       6
1  1       6
2  1       6

## <center>üèÜ Challenge

Create a data frame, named df3, which contains:

* 'E' = np.array([4] * 5,dtype='int32')

* 'Day' = 2

In [9]:
df3 = pd.DataFrame({
    'E':np.array([4] * 5, dtype='int32'),
    'Day':2
})
df3

   E  Day
0  4    2
1  4    2
2  4    2
3  4    2
4  4    2

--------

## <center> Importing Files

### Import .csv files

Use the file path: /home/rhyme/Desktop/Project/

(Note: If you want to use this command for a file on your own system, be sure to use the correct file path.)

In [14]:
df4 = pd.read_csv('practicedata.csv')
df4.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

-----------------

## <center>üèÜ Challenge
    
Import the file practicedata.json in the dataframe df5.

Use the file path: /home/rhyme/Desktop/Project/

In [13]:
df5 = pd.read_json('practicedata.json')
df5.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

### Importing Files from a url

Import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")

In [16]:
df6 = pd.read_csv('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv')
df6.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

## <center>üèÜ Challenge
    
Create the data frame df7.

Then import data from this github repo: https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json

In [17]:
df7 = pd.read_json('https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json')
df7.head()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241

## <center> Export Files

### Export .csv Files

In [18]:
df4.to_csv('practicedata2.csv')

## <center>üèÜ Challenge

Export the data from df4 to 'practicedata2.json'

Use the file path:/home/rhyme/Desktop/Project/

In [19]:
df4.to_json('practicedata2.json')

## <center>Data Summary
    
We will be working with data frame df6 for this section.

In [20]:
#first run this cell to create the data frame df6
df6 = pd.read_csv("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.csv")
df6

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

### Quick Summary of Data

In [21]:
df6.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       7 non-null      float64
 1   B       8 non-null      float64
 2   C       8 non-null      float64
 3   D       7 non-null      float64
dtypes: float64(4)
memory usage: 384.0 bytes

### Detailed Summary of Data

In [22]:
df6.describe()

              A         B         C         D
count  7.000000  8.000000  8.000000  7.000000
mean  -0.412650  0.331360  0.619777 -0.021321
std    0.533101  1.010369  0.987050  1.192849
min   -1.013616 -1.604969 -1.174912 -1.632132
25%   -0.751291 -0.224553  0.095289 -0.766418
50%   -0.488965  0.549208  0.829525 -0.529912
75%   -0.161808  0.946528  1.079757  1.041241
max    0.440231  1.713480  1.786915  1.463154

## <center>View Columns

In [23]:
df6.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>üèÜ Challenge
    
View the columns in df7.

In [24]:
#first run this cell to create the data frame df7
df7 = pd.read_json("https://raw.githubusercontent.com/VinitaSilaparasetty/Coursera-Pandas-for-Beginners/master/practicedata.json")
df7

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

In [25]:
df7.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

## <center>View Datatypes

In [26]:
df6.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>üèÜ Challenge
    
View the datatypes in df7

In [27]:
df7.dtypes

A    float64
B    float64
C    float64
D    float64
dtype: object

## <center>Handling Duplicates

### Detect Duplicate Rows

In [28]:
df6.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

### Drop Duplicate Rows

In [29]:
df6.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop duplicates in df7

In [30]:
df7.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7     True
dtype: bool

In [31]:
df7.drop_duplicates()

          A         B         C         D
0       NaN -1.604969 -0.106263 -1.002924
1 -0.404667  0.458565 -1.174912       NaN
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912

## <center>Handling Missing Values

### Detect Missing Values

In [35]:
print(df6.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

### Drop Missing Values

In [36]:
print(df6.dropna())

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>üèÜ Challenge
    
Detect and drop missing values in df7

In [37]:
#Detect missing values
print(df7.isnull().sum())

A    1
B    0
C    0
D    1
dtype: int64

In [38]:
#Drop missing values
print(df7.dropna())

          A         B         C         D
2  0.440231  1.713480  0.162473 -1.632132
3  0.081050  0.639851  0.844037  1.463154
4 -1.013616 -0.224553  1.786915  1.041241
5 -1.013616 -0.224553  1.786915  1.041241
6 -0.488965  0.946528  0.829525 -0.529912
7 -0.488965  0.946528  0.829525 -0.529912

## <center>Numeric Operations

We will work with the data frame df8.

In [39]:
#first run this cell to create the dataframe df8
df8 = pd.DataFrame(np.random.randn(6,4))
df8

          0         1         2         3
0 -0.052827 -0.049098 -0.361656  1.301262
1 -1.458674 -1.318407  0.762623 -0.003288
2  0.325724 -0.068320 -0.604430 -0.585633
3  0.596177  0.060337 -1.957547 -0.086901
4  1.407275  2.216282 -0.995452 -0.551580
5 -0.247870 -0.455708  0.298400 -0.087993

### Calculate the Mean:

In [40]:
df8.mean()

0    0.094967
1    0.064181
2   -0.476344
3   -0.002356
dtype: float64

## <center>üèÜ Challenge
    
Calculate the mean of df9

In [41]:
#first run this cell to create df9
df9 = pd.DataFrame(np.random.randn(3,4))
df9

          0         1         2         3
0  0.341818 -1.903687  0.675947  0.417906
1  0.109553  0.834518 -0.965266  0.008857
2 -1.095782 -0.623701 -1.409333 -0.681395

In [42]:
df9.mean()

0   -0.214804
1   -0.564290
2   -0.566217
3   -0.084877
dtype: float64

### Calculate the Cumulative Sum:

In [43]:
df8.apply(np.cumsum)

          0         1         2         3
0 -0.052827 -0.049098 -0.361656  1.301262
1 -1.511502 -1.367505  0.400967  1.297974
2 -1.185778 -1.435825 -0.203463  0.712341
3 -0.589601 -1.375488 -2.161010  0.625440
4  0.817673  0.840794 -3.156462  0.073860
5  0.569803  0.385085 -2.858062 -0.014133

## <center>üèÜ Challenge
    
Calculate the cumulative sum of df9

In [44]:
df9.apply(np.cumsum)

          0         1         2         3
0  0.341818 -1.903687  0.675947  0.417906
1  0.451371 -1.069168 -0.289318  0.426763
2 -0.644411 -1.692869 -1.698651 -0.254632

### Find the Maximum Value:

In [45]:
df8.max()

0    1.407275
1    2.216282
2    0.762623
3    1.301262
dtype: float64

## <center>üèÜ Challenge

Find the maximum value of df9

In [46]:
df9.max()

0    0.341818
1    0.834518
2    0.675947
3    0.417906
dtype: float64

### Find the Minimum Value:

In [47]:
df8.min()

0   -1.458674
1   -1.318407
2   -1.957547
3   -0.585633
dtype: float64

## <center>üèÜ Challenge

Find the minimum value of df9

In [48]:
df9.min()

0   -1.095782
1   -1.903687
2   -1.409333
3   -0.681395
dtype: float64

## <center>String Manipulation

We will work with the series s7 for this section.

In [49]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

### Convert to Lower Case

In [50]:
s7.str.lower()

0               animal
1                 bird
2     pandas library
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to lower case.

In [51]:
s8 = np.array(['cat', 'dog', ' Python Programming    '])
s8= pd.Series(s8)
s8

0                        cat
1                        dog
2     Python Programming
dtype: object

In [52]:
s8.str.lower()

0                        cat
1                        dog
2     python programming
dtype: object

---------------

### Convert to Upper Case

In [53]:
s7.str.upper()

0               ANIMAL
1                 BIRD
2     PANDAS LIBRARY
dtype: object

## <center>üèÜ Challenge

Convert the strings in s8 to upper case.

In [54]:
s8.str.upper()

0                        CAT
1                        DOG
2     PYTHON PROGRAMMING
dtype: object

### Swap Capitalization

In [55]:
s7.str.swapcase()

0               ANIMAL
1                 BIRD
2     pANDAS lIBRARY
dtype: object

## <center>üèÜ Challenge

Swap the capitalization of the strings in s8.

In [56]:
s8.str.swapcase()

0                        CAT
1                        DOG
2     pYTHON pROGRAMMING
dtype: object

### Find Length of String

In [57]:
s7.str.len()

0     6
1     4
2    17
dtype: int64

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [58]:
s8.str.len()

0     3
1     3
2    23
dtype: int64

-------------

### Split String

In [59]:
s7.str.split()

0             [animal]
1               [bird]
2    [Pandas, Library]
dtype: object

## <center>üèÜ Challenge

Find the length of the strings in s8.

In [60]:
#first run this cell to create the series s8
s8 = np.array(['cat','dog',' Python Programming  '] )
s8= pd.Series(s8)
s8

0                      cat
1                      dog
2     Python Programming
dtype: object

In [61]:
s8.str.split()

0                    [cat]
1                    [dog]
2    [Python, Programming]
dtype: object

### Detect Unique Values

In [62]:
s7.unique()

array(['animal', 'bird', ' Pandas Library  '], dtype=object)

## <center>üèÜ Challenge

Detect unique values in s8.

In [63]:
s8.unique()

array(['cat', 'dog', ' Python Programming  '], dtype=object)

### Repeat String

We will work with the series s7 for this section.

In [64]:
#first run this cell to create series s7
s7 = np.array(['animal','bird',' Pandas Library  '] )
s7= pd.Series(s7)
s7

0               animal
1                 bird
2     Pandas Library
dtype: object

In [65]:
repeat_list=[2,3,2]
s7.str.repeat(repeat_list)

0                          animalanimal
1                          birdbirdbird
2     Pandas Library   Pandas Library
dtype: object

## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [ ]:
## <center>üèÜ Challenge

Repeat the values in s8 in the order [1,2,3]

In [66]:
repeat_list2 = [1,2,3]
s8.str.repeat(repeat_list2)

0                                                  cat
1                                               dogdog
2     Python Programming   Python Programming   Pyt...
dtype: object